{
    "2025-10-01": {
        "mumblemancer": [
            {
                "code_imp": "changed SPACEBAR to \\\" \\\""
            }
        ],
        "Wouju": [
            {
                "rscdel": "Guillotine no longert forces you to clap"
            }
        ],
        "CheffieGithub": [
            {
                "refactor": "Refactored advclass to be a subtype of job and migrant_role to reference a job. report any role weirdness."
            },
            {
                "admin": "Select Equipment renamed to Admin Dress, can now equip jobs and outfits are listed immediately."
            }
        ]
    },
    "2025-10-02": {
        "wgtjunior743": [
            {
                "admin": "New Admin verb at the VV dropdown to coronate someone."
            },
            {
                "rscadd": "Migrant Waves got their description at the menu."
            }
        ],
        "CheffieGithub": [
            {
                "bugfix": "Fixed locks being able to unlock things :D"
            }
        ],
        "flleeppyy": [
            {
                "server": "Changes made to main config, `SERVERNAME`, `SERVERSUBTITLE` and `HOSTEDBY` namely."
            }
        ],
        "grungussuss": [
            {
                "rscadd": "donators get 1.5x triumph gain"
            },
            {
                "rscadd": "donators can take up to 3 cosmetic items with them into the game"
            },
            {
                "rscdel": "hollowkin and kobolds are no longer patreon exclusive"
            },
            {
                "rscadd": "The broodmother"
            }
        ],
        "snowyseshi": [
            {
                "rscadd": "Added a pouch with mammons to the VL"
            }
        ]
    },
    "2025-10-03": {
        "snowyseshi": [
            {
                "code_imp": "Silver enchant now checks if its used by a weapon."
            },
            {
                "balance": "more chance to roll secondary antag if the storyteller rolls maniac or aspirant in highpop"
            }
        ],
        "Siro": [
            {
                "bugfix": "Replace unicode form of music notes to ascii for proper runechat handling."
            },
            {
                "rscadd": "Another music note. Why not?"
            }
        ],
        "Wouju": [
            {
                "balance": "Mantrap crafting recipe, the non-anvil one, makes a makeshift mantrap instead of an old one"
            },
            {
                "map": "City garrison has more light sources"
            }
        ],
        "wgtjunior743": [
            {
                "rscadd": "Peeks, if you examine someone while you are sneaking there will be no visible message but the target may notice you looking at them based on your sneak skill vs theirs PER and abit of luck."
            },
            {
                "bugfix": "Minotaur sometimes attacking as a corpse."
            },
            {
                "rscadd": "Minotaur axe variant now drops a double head greataxe upon death."
            }
        ],
        "Magiy-Anne": [
            {
                "rscadd": "Added half-drow, drow, half-orcs, and tieflings to Rejected Royal Wretch"
            }
        ]
    },
    "2025-10-04": {
        "CheffieGithub": [
            {
                "bugfix": "Fixed loadout patreon rank checks"
            }
        ],
        "RelentlessDouche": [
            {
                "balance": "Readjusted Ruffian"
            }
        ],
        "wgtjunior743": [
            {
                "admin": "Yielding now logs for admins."
            }
        ],
        "snowyseshi": [
            {
                "code_imp": "make restricted roles less strict for vampire and lich"
            }
        ],
        "SarmentiCampbell": [
            {
                "balance": "Youngling/Old Maniac/lich have now the same stats as their adult counterpart."
            },
            {
                "rscadd": "Give Ability to remove Foreigner from Disgraced Knight, Rejected Royal"
            },
            {
                "rscadd": "Poisons bombs are now craftable."
            },
            {
                "balance": "Noble Scabbard now has silver Enchant."
            },
            {
                "balance": "Summon Rous, Conjure Puffer and Conjure Poison Bomb should no longer give you Arcane Skill"
            }
        ],
        "Arkatos": [
            {
                "rscadd": "God's chosen received an ability to view their tasks at any time via new button."
            },
            {
                "rscadd": "God's chosen tasks have new, varied rewards."
            }
        ],
        "Ambrose997": [
            {
                "balance": "nerfed hedge mage's physical stats down to the same level as normal mages."
            }
        ],
        "Bloo4420": [
            {
                "rscadd": "More filled_overlay sprites for peddlers"
            },
            {
                "bugfix": "Innkeep and Steward peddler now hold keys that can actually be used"
            }
        ]
    }
}