{"Contents":["
<p><br></p><p><strong>&quot;
ADVICE FOR MY SUCCESSORS
&quot;</strong></p><p><br></p><p>

This is no hard guild to be in charge of, people come and work until it gets them killed, unless you have an affliction of a fool being upset with that fact, you will most likely do fine.
</p><p><br></p><p>

Of course, while it is easy, it is another thing to be good at it. Unless you have the respect of the people, someone else will take your place by force. Anyone can have the ring afterall, so here is my advice to not lose your head.
</p><p><br></p><p>

Firsty, your duties outside of the usual guild chores. It is your responsiblity to take the jobs people offer and assure they are being completed. This can range from a lot of things; escorting someone, guarding some place, killing some beast for an exotic part, its not terribly important.
</p><p><br></p><p>

What you mostly care about is that the quest is being worked on, and if its not replacing the person with someone else who is more capable or not dead from attempting it. And that by the end the client recives the item they requiested or are happy with the service provided.
</p><p><br></p><p>

What differentiates a good Gaffer and a Bad one, is knowing who works best for what job. Get to know your guild members, take in their strenghts and weaknesses, how they behave, what they are willing to do. Not all clients may like a chatty guard, some may. You should know who to suggest.
</p><p><br></p><p>

You may also go out of your way to find talent as well, not everyone thinks they have what it takes, and frankly most dont. But if they die working for you, its not a lost to you, and if they don't, even better! for example, those house of the ten acolytes sure don't go out much, just think how much longer your people could be in the field if they actually used their miracles to heal them.
</p><p><br></p><p>

As a rule of thumb, it is a good idea to keep track of who the shady characters are. The ones better suited for less lawfull work. You should aim to keep your nose clean, the king's men will always outpower you, but should you find the want they will be good to work 'undesireble' jobs and easy to blame and denounce should the heat get too much.
</p><p><br></p><p>

Now onto your machines, the HAILER and HAILERBOARDS, disgusting and loud things that sadly have use to you. When a HAILER consumes parchment, it will magically showcase the same piece of parchment across the many linked HAILERBOARDs, making it very convinient to relay your notices.
</p><p><br></p><p>

Managing the notices is easy, so here is what you actually care about, how you should monetize it! Its pretty simple, if the job can procure you monster heads, which is your main income, best leave it alone. If its some lowly priest asking for carpenters that can fix a hole in the church. bleed them dry, they are taking up precious space for something that actually concerns your guild!
</p><p><br></p><p>

What else, what else. Right, some pointers. Though the Maker's guild and your guild aren't actually related, it is best you maintain a close relationship with them. They maintain your people's gear and provide better ones. so getting on their bad side is a dumb idea. They also do not have a central representetive, so if need be, you should go out of your way to stand up for them.
</p><p><br></p><p>

If you feel like it, you can also be an order drop point for the Maker's guild. You have the Mail system set up already, if people can rely on you taking care of their orders being done, they spend less time in line, and more time working. Which is an obvious plus.
</p><p><br></p><p>

</p><p><br></p>"]}
